[
    {
        "id": 1,
        "title": "Gourmet Steak",
        "image": "img/gallery/img_1.jpg",
        "chefId": 4,
        "desc": "A perfectly premium cut with sophisticated accompaniments.",
        "rating": 4,
        "mins": 40,
        "people": 2,
        "ingredients": [
            "1 premium cut of your choice (such as ribeye steak, filet mignon, or salmon)",
            "Coarse sea salt",
            "Freshly ground black pepper",
            "Extra virgin olive oil",
            "2 cloves of garlic, minced",
            "Fresh rosemary sprigs",
            "250g fresh asparagus",
            "150g shiitake mushrooms or your choice of mushrooms",
            "2 tablespoons butter",
            "2 tablespoons truffle oil (or extra virgin olive oil)",
            "Salt and pepper to taste",
            "200g baby potatoes (optional)"
          ],
          "stepByStep": [
            "Remove the premium cut from the refrigerator and let it rest at room temperature for about 30 minutes before cooking.",
            "Preheat the grill or barbecue to medium-high heat. If using a charcoal grill, ensure the coals are well-ignited.",
            "While the grill is heating, rub both sides of the premium cut with coarse sea salt and freshly ground black pepper. Let it rest for a few minutes to allow the seasonings to penetrate the meat.",
            "Brush the meat with extra virgin olive oil and sprinkle minced garlic and fresh rosemary sprigs on top.",
            "Place the premium cut on the preheated grill and cook to your desired level of doneness. For medium-rare, grill for about 3-4 minutes on each side, adjusting the cooking time as needed.",
            "While the meat is grilling, prepare the sophisticated accompaniments. Wash the asparagus and shiitake mushrooms.",
            "In a large skillet, melt butter and truffle oil (or olive oil) over medium-high heat. Add sliced shiitake mushrooms and asparagus, and cook for 4-5 minutes until they become tender and golden. Season with salt and pepper to taste.",
            "If using baby potatoes, cook them in boiling water until they are tender, about 10-15 minutes. Drain and season with a little olive oil, salt, and pepper.",
            "Serve the perfectly grilled premium cut, sliced, with the sophisticated accompaniments. Add the baby potatoes as a side, if desired. Drizzle the meat with the cooking juices that have accumulated during the resting period.",
            "Serve immediately and enjoy this sophisticated and delicious meal!"
          ]
    },
    {
        "id": 2,
        "title": "Dragon Roll",
        "image": "img/gallery/img_22.jpg",
        "chefId": 1,
        "desc": "A delectable sushi roll featuring eel, avocado, and a savory sauce.",
        "rating": 4,
        "mins": 20,
        "people": 4,
        "ingredients": [
            "1 sheet of nori (seaweed)",
            "1 cup sushi rice, cooked and seasoned with rice vinegar, sugar, and salt",
            "1/4 cup unagi sauce (eel sauce)",
            "1/2 avocado, thinly sliced",
            "4-5 slices of grilled eel (unagi)",
            "Sesame seeds, for garnish",
            "Pickled ginger, for serving",
            "Wasabi, for serving",
            "Soy sauce, for dipping"
          ],
          "stepByStep": [
            "Place a bamboo sushi rolling mat (makisu) on a clean surface. Lay a sheet of plastic wrap on top of the mat.",
            "Place the nori sheet, shiny side down, onto the plastic wrap-covered sushi mat.",
            "Wet your fingers to prevent sticking, and evenly spread a layer of sushi rice over the nori, leaving about half an inch of nori uncovered at the top.",
            "Drizzle a tablespoon of unagi sauce over the rice.",
            "Lay the avocado slices and grilled eel strips on top of the rice.",
            "Sprinkle sesame seeds over the eel and avocado.",
            "Using the bamboo mat, carefully roll up the sushi, applying gentle pressure to shape it into a tight cylinder. Wet the uncovered edge of the nori to seal the roll.",
            "Remove the plastic wrap, and place the sushi roll on a cutting board.",
            "With a sharp, wet knife, slice the roll into bite-sized pieces.",
            "Serve the eel and avocado sushi roll with pickled ginger, wasabi, and soy sauce for dipping.",
            "Enjoy your delectable sushi roll!"
          ]
    },
    {
        "id": 3,
        "title": "Angus Burger",
        "image": "img/gallery/img_8.jpg",
        "chefId": 6,
        "desc": "A delectable Angus beef burger adorned with gourmet toppings.",
        "rating": 5,
        "mins": 45,
        "people": 4,
        "ingredients": [
            "1 pound Angus beef ground meat",
            "Salt and freshly ground black pepper to taste",
            "4 burger buns",
            "4 slices of gourmet cheese (such as Gruyère, blue cheese, or brie)",
            "4 slices of crispy bacon",
            "1/4 cup caramelized onions",
            "1/4 cup arugula or baby spinach",
            "1/4 cup sliced ripe tomatoes",
            "1/4 cup sautéed mushrooms (optional)",
            "1/4 cup gourmet burger sauce (mayonnaise mixed with Dijon mustard and a touch of honey)",
            "1 tablespoon olive oil"
          ],
          "stepByStep": [
            "Preheat your grill or stovetop griddle over medium-high heat. While it's heating, divide the ground Angus beef into four equal portions and gently form them into burger patties. Season each patty generously with salt and freshly ground black pepper.",
            "Place the burger patties on the hot grill or griddle and cook to your preferred level of doneness, usually 3-4 minutes per side for medium-rare. Adjust cooking time as needed.",
            "While the burgers are cooking, lightly brush the burger buns with olive oil and toast them on the grill or in a separate skillet until they're lightly browned and crisp. Remove and set aside.",
            "During the last minute of cooking, place a slice of gourmet cheese on each burger patty and allow it to melt.",
            "Assemble your delectable Angus beef burgers: Place a slice of crispy bacon on the bottom half of each toasted bun. Top with a burger patty, followed by caramelized onions, sautéed mushrooms (if using), arugula or baby spinach, and sliced ripe tomatoes.",
            "Spread a generous dollop of gourmet burger sauce on the top half of each bun.",
            "Place the top bun with sauce on top of the toppings to complete the burger.",
            "Serve your gourmet Angus beef burgers hot and enjoy the delectable combination of flavors and textures!"
          ]
    },
    {
        "id": 4,
        "title": "Meatball Pasta",
        "image": "img/gallery/img_12.jpg",
        "chefId": 5,
        "desc": "A fusion of spicy meatballs and pasta with a Mexican twist.",
        "rating": 3,
        "mins": 50,
        "people": 2,
        "ingredients": [
            "1 pound ground beef or ground turkey",
            "1/2 cup breadcrumbs",
            "1/4 cup grated Parmesan cheese",
            "1/4 cup finely chopped onion",
            "1/4 cup chopped fresh cilantro",
            "1 egg",
            "1 teaspoon chili powder",
            "1/2 teaspoon cumin",
            "1/2 teaspoon paprika",
            "1/4 teaspoon cayenne pepper (adjust to taste)",
            "Salt and black pepper to taste",
            "2 cups cooked pasta (such as spaghetti or penne)",
            "1 cup tomato sauce",
            "1 cup diced tomatoes with green chilies (canned)",
            "1/2 cup shredded Mexican blend cheese",
            "Sliced green onions and chopped fresh cilantro for garnish",
            "Sour cream and lime wedges for serving (optional)"
          ],
          "stepByStep": [
            "In a mixing bowl, combine ground beef or turkey, breadcrumbs, grated Parmesan cheese, chopped onion, chopped cilantro, egg, chili powder, cumin, paprika, cayenne pepper, salt, and black pepper. Mix well until all ingredients are thoroughly combined.",
            "Form the mixture into meatballs of your desired size, typically about 1 to 1.5 inches in diameter.",
            "Heat a large skillet over medium-high heat and add a bit of cooking oil. Once the oil is hot, add the meatballs and cook until browned on all sides and cooked through, about 8-10 minutes. Transfer the cooked meatballs to a plate and set aside.",
            "In the same skillet, add the cooked pasta, tomato sauce, and diced tomatoes with green chilies. Stir to combine and heat through until the sauce is simmering.",
            "Return the cooked meatballs to the skillet with the pasta and sauce. Allow them to simmer together for an additional 5 minutes, so the flavors meld.",
            "Sprinkle shredded Mexican blend cheese over the pasta and meatballs. Cover the skillet and let it cook for 2-3 minutes, or until the cheese is melted and bubbly.",
            "Garnish the dish with sliced green onions and chopped fresh cilantro.",
            "Serve the flavorful Mexican-inspired spicy meatballs and pasta hot, with optional sides of sour cream and lime wedges. Enjoy this delightful fusion dish!"
          ]
    },
    {
        "id": 5,
        "title": "Samba Soul Feijoada",
        "image": "img/gallery/img_14.jpg",
        "chefId": 2,
        "mins": 70,
        "people": 5,
        "desc": "A traditional Brazilian black bean stew with a soulful twist.",
        "rating": 5,
        "ingredients": [
            "2 cups black beans (feijão preto), dried or canned",
            "1 tablespoon vegetable oil",
            "1 onion, finely chopped",
            "3 cloves garlic, minced",
            "1 bell pepper (any color), chopped",
            "2 bay leaves",
            "1 teaspoon cumin powder",
            "1 teaspoon paprika",
            "1/2 teaspoon cayenne pepper (adjust to taste)",
            "1/2 teaspoon black pepper",
            "1 teaspoon salt (adjust to taste)",
            "2 chorizo sausages, sliced (optional)",
            "4 cups chicken or vegetable broth",
            "2 cups butternut squash, diced",
            "1 cup kale, chopped",
            "Juice of 1 lime",
            "Fresh cilantro leaves, for garnish",
            "Cooked rice, for serving"
          ],
          "stepByStep": [
            "If using dried black beans, soak them in water overnight or use the quick-soak method according to package instructions. Drain and rinse the soaked beans before using.",
            "In a large pot, heat the vegetable oil over medium heat. Add the chopped onion, minced garlic, and bell pepper. Sauté until the vegetables are soft and fragrant, about 5 minutes.",
            "Add the bay leaves, cumin powder, paprika, cayenne pepper, black pepper, and salt to the pot. Stir well to combine and cook for another 2 minutes.",
            "If using chorizo sausages, add them to the pot and cook until they start to brown, about 3-4 minutes.",
            "Add the soaked (or canned) black beans and chicken or vegetable broth to the pot. Bring the mixture to a boil, then reduce the heat to low, cover, and simmer for about 1 to 1.5 hours, or until the beans are tender and cooked through. Stir occasionally and add more broth if needed to keep the beans submerged.",
            "Once the beans are tender, add the diced butternut squash to the pot and simmer for an additional 15-20 minutes, or until the squash is tender and can be easily pierced with a fork.",
            "Stir in the chopped kale and lime juice. Cook for an additional 5 minutes until the kale is wilted and tender.",
            "Taste the stew and adjust the seasonings if necessary by adding more salt or spices to your liking.",
            "Remove the bay leaves from the stew and discard them.",
            "Serve the delicious Brazilian black bean stew hot, garnished with fresh cilantro leaves. It's traditionally served over cooked rice for a hearty and soulful meal."
          ]
    },
    {
        "id": 6,
        "title": "Magic Pizza",
        "image": "img/gallery/img_20.jpg",
        "chefId": 3,
        "desc": "A delightful pizza topped with the magic of pepperoni slices.",
        "rating": 4,
        "mins": 50,
        "people": 4,
        "ingredients": [
            "1 pizza dough (store-bought or homemade)",
            "1/2 cup pizza sauce",
            "1 1/2 cups shredded mozzarella cheese",
            "1/2 cup sliced pepperoni",
            "1/4 cup sliced black olives (optional)",
            "1/4 cup sliced green bell peppers (optional)",
            "1/4 cup sliced red onions (optional)",
            "1/2 teaspoon dried oregano",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon red pepper flakes (optional)",
            "Fresh basil leaves, for garnish (optional)",
            "Grated Parmesan cheese, for serving",
            "Olive oil, for brushing"
          ],
          "stepByStep": [
            "Preheat your oven to the highest temperature it can reach (usually around 475-500°F or 245-260°C). If you have a pizza stone, place it in the oven while preheating.",
            "Roll out the pizza dough on a floured surface into your desired shape (round, rectangular, etc.). If you're using a pizza stone, transfer the rolled-out dough to a piece of parchment paper for easy transfer to the stone later.",
            "Brush the rolled-out dough lightly with olive oil to create a crispy crust.",
            "Spread the pizza sauce evenly over the dough, leaving a small border around the edges for the crust.",
            "Sprinkle the shredded mozzarella cheese evenly over the sauce.",
            "Arrange the pepperoni slices (and any optional toppings you choose, such as black olives, green bell peppers, or red onions) over the cheese.",
            "Sprinkle dried oregano, garlic powder, and red pepper flakes (if using) evenly over the toppings.",
            "Carefully transfer the pizza (with the parchment paper if using a stone) to a baking sheet or a preheated pizza stone in the oven.",
            "Bake the pizza for about 10-12 minutes or until the crust is golden brown and the cheese is bubbly and slightly browned.",
            "Remove the pizza from the oven and let it cool for a minute. Sprinkle fresh basil leaves on top if desired.",
            "Slice the delightful pepperoni pizza, serve it hot, and don't forget to offer grated Parmesan cheese for extra flavor."
          ]
    }
]